read_verilog src/add.v src/sub.v src/mux.v src/alu.v src/cpu.v
hierarchy -top cpu
select cpu
proc; opt; fsm; opt
techmap
show -format pdf